In [ ]:
#common techniques to deal with missing values
#1. Drop the feature
#2. Drop the row
#3. Impute the missing value
#4. Replace it

In [ ]:
#Using reindexing, we have created a DataFrame with missing values

In [8]:
# import the pandas library
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

print(df)

        one       two     three
a -0.785252 -0.309015  0.907843
b       NaN       NaN       NaN
c -0.372665  1.535248 -1.552323
d       NaN       NaN       NaN
e -0.176991 -1.776597  0.084628
f  1.584635  0.038229 -0.278147
g       NaN       NaN       NaN
h -0.122752 -1.891960 -1.095836

In [ ]:
#Check for Missing Values
#To make detecting missing values easier (and across different array dtypes), 
#Pandas provides the isnull() and notnull() functions, which are also methods on Series and DataFrame objects −

In [5]:
print(df['one'].isnull())

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [ ]:
#Cleaning / Filling Missing Data
#Pandas provides various methods for cleaning the missing values. 
#The fillna function can “fill in” NA values with non-null data in a couple of ways
#Replace NaN with a Scalar Value
#replacing "NaN" with "0".

In [1]:
# import the pandas library
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

print(df)
print(df.fillna(0))

        one       two     three
a -1.728423  0.843059 -0.154534
b       NaN       NaN       NaN
c -0.876396 -0.156221 -0.433240
d       NaN       NaN       NaN
e  0.593602 -0.495417 -1.864895
f -1.082944  1.175838  1.673957
g       NaN       NaN       NaN
h -0.930316  0.435645  0.202359
        one       two     three
a -1.728423  0.843059 -0.154534
b  0.000000  0.000000  0.000000
c -0.876396 -0.156221 -0.433240
d  0.000000  0.000000  0.000000
e  0.593602 -0.495417 -1.864895
f -1.082944  1.175838  1.673957
g  0.000000  0.000000  0.000000
h -0.930316  0.435645  0.202359

In [6]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(3, 3), index=['a', 'c', 'e'],columns=['one','two', 'three'])
df = df.reindex(['a', 'b', 'c'])
print(df)
print ("NaN replaced with '0':")
print(df.fillna(0))

        one       two     three
a  0.899593  2.211449  0.344242
b       NaN       NaN       NaN
c -0.199434 -0.789019  1.713510
NaN replaced with '0':
        one       two     three
a  0.899593  2.211449  0.344242
b  0.000000  0.000000  0.000000
c -0.199434 -0.789019  1.713510

In [ ]:
#Fill NA Forward and Backward
#Using the concepts of filling discussed in the ReIndexing Chapter we will fill the missing values.
#pad/fill --Fill methods Forward
#bfill/backfill--Fill methods Backward

In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
print("Data frame before replacing")
print(df)
print("Data frame after replacing")
print(df.fillna(method='pad'))

Data frame before replacing
        one       two     three
a  1.602260  1.044530 -0.594246
b       NaN       NaN       NaN
c  0.229983 -0.201410 -1.965587
d       NaN       NaN       NaN
e -0.185311 -0.307990  0.922424
f -0.331650  0.299070 -0.574239
g       NaN       NaN       NaN
h -0.494652 -0.686017 -0.813716
Data frame after replacing
        one       two     three
a  1.602260  1.044530 -0.594246
b  1.602260  1.044530 -0.594246
c  0.229983 -0.201410 -1.965587
d  0.229983 -0.201410 -1.965587
e -0.185311 -0.307990  0.922424
f -0.331650  0.299070 -0.574239
g -0.331650  0.299070 -0.574239
h -0.494652 -0.686017 -0.813716

In [ ]:
#Drop Missing Values
# dropna function along with the axis argument used to simply exclude the missing values.
#By default, axis=0, i.e., along row, which means that if any value within a row is NA then the whole row is excluded.

In [3]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
print("Data frame before drop")
print(df)
print("Data frame after drop")
print(df.dropna())

Data frame before replacing
        one       two     three
a  0.920221  0.641430 -0.874369
b       NaN       NaN       NaN
c  2.186056  0.435682 -1.415550
d       NaN       NaN       NaN
e -0.151124 -0.548430  0.266014
f -1.452772  0.977085 -0.001316
g       NaN       NaN       NaN
h -0.840058  0.833498  0.148154
Data frame after replacing
        one       two     three
a  0.920221  0.641430 -0.874369
c  2.186056  0.435682 -1.415550
e -0.151124 -0.548430  0.266014
f -1.452772  0.977085 -0.001316
h -0.840058  0.833498  0.148154

In [ ]:
#Replace Missing (or) Generic Values
#to replace a generic value with some specific valueuse replace method.
#Replacing NA with a scalar value is equivalent behavior of the fillna() function.

In [10]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'one':[10,20,30,40,50,2000],'two':[1000,0,30,40,50,60]})
print(df.replace({1000:10,2000:60}))

   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

In [ ]:
#Reading Data from CSV file

In [ ]:
#CSV(comma separated values) is a fundamental necessity in Data Science. 
#data from various sources which can get exported to CSV format so that they can be used by other systems. 
#The Panadas library provides features using it, read the CSV file in full as well as in parts for only a selected group of columns and rows.

#Input as CSV File
#The csv file is a text file in which the values in the columns are separated by a comma. 
#Let's consider the following data present in the file named input.csv.

#create CSV file using notepad by copying and pasting data. 
#Save the file as input.csv using the save As All files(*.*) option in notepad.

In [ ]:
id,name,salary,start_date,dept
1,Rick,623.3,2012-01-01,IT
2,Dan,515.2,2013-09-23,Operations
3,Tusar,611,2014-11-15,IT
4,Ryan,729,2014-05-11,HR
5,Gary,843.25,2015-03-27,Finance
6,Rasmi,578,2013-05-21,IT
7,Pranab,632.8,2013-07-30,Operations
8,Guru,722.5,2014-06-17,Finance

In [ ]:
#Reading a CSV File
#The read_csv function of the pandas library is used read the content of a CSV file into the python environment as a pandas DataFrame.
#The function can read the files from the OS by using proper path to the file.

In [13]:
import pandas as pd
data = pd.read_csv('Dataset-example.csv')
print (data)
data = data.reindex([0:12])

SyntaxError: invalid syntax (<ipython-input-13-5157bcb788e1>, line 4)

In [11]:
#Reading Specific Rows- Usinge read_csv()
#The read_csv function of the pandas library can also be used to read some specific rows for a given column. 
# slice the result from the read_csv function 
# Slicing for first 5 rows for the column named salary.

In [13]:
import pandas as pd
data = pd.read_csv('Dataset-example.csv')

# Slice the result for first 5 rows
print (data[0:5]['salary'])

0    623.30
1    515.20
2    611.00
3    729.00
4    843.25
Name: salary, dtype: float64

In [ ]:
#Reading Specific Columns
#The read_csv function of the pandas library can also be used to read some specific columns. 
#use the multi-axes indexing method called .loc() for this purpose.
#display the salary and name column for all the rows.

In [14]:
import pandas as pd
data = pd.read_csv('input.csv')

# Use the multi-axes indexing funtion
print (data.loc[:,['salary','name']])

   salary    name
0  623.30    Rick
1  515.20     Dan
2  611.00   Tusar
3  729.00    Ryan
4  843.25    Gary
5  578.00   Rasmi
6  632.80  Pranab
7  722.50    Guru

In [ ]:
#Reading Specific Columns and Rows- Usinge read_csv()
#use the multi-axes indexing method called .loc()
#display the salary and name column for some of the rows.

In [15]:
import pandas as pd
data = pd.read_csv('input.csv')

# Use the multi-axes indexing funtion
print (data.loc[[1,3,5],['salary','name']])

   salary   name
1   515.2    Dan
3   729.0   Ryan
5   578.0  Rasmi

In [ ]:
#Reading Specific Columns for a Range of Rows- Usinge read_csv()
# use the multi-axes indexing method called .loc()  
#display the salary and name column for some of the rows.

In [18]:
import pandas as pd
data = pd.read_csv('input.csv')

# Use the multi-axes indexing funtion
print (data.loc[2:6,['salary','name']])

   salary    name
2  611.00   Tusar
3  729.00    Ryan
4  843.25    Gary
5  578.00   Rasmi
6  632.80  Pranab

In [19]:
#displaying the first five rows of dataset 
data = pd.read_csv('input.csv')
data.head()

   id   name  salary  start_date        dept
0   1   Rick  623.30  2012-01-01          IT
1   2    Dan  515.20  2013-09-23  Operations
2   3  Tusar  611.00  2014-11-15          IT
3   4   Ryan  729.00  2014-05-11          HR
4   5   Gary  843.25  2015-03-27     Finance

In [20]:
#displayinf last five rows of dataset
data.tail()

   id    name  salary  start_date        dept
3   4    Ryan  729.00  2014-05-11          HR
4   5    Gary  843.25  2015-03-27     Finance
5   6   Rasmi  578.00  2013-05-21          IT
6   7  Pranab  632.80  2013-07-30  Operations
7   8    Guru  722.50  2014-06-17     Finance

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      int64
 1   name        8 non-null      object
 2   salary      8 non-null      float64
 3   start_date  8 non-null      object
 4   dept        8 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 448.0+ bytes

In [30]:
data.shape

(8, 5)

In [ ]:
#Rebuild Missing Data

#To find and fill the missing data in the dataset 
#There are 4 ways to find the null values if present in the dataset.

In [22]:
# Using isnull()- provides the boolean value for the complete dataset to know if any null value is present or not.
data.isnull()

      id   name  salary  start_date   dept
0  False  False   False       False  False
1  False  False   False       False  False
2  False  False   False       False  False
3  False  False   False       False  False
4  False  False   False       False  False
5  False  False   False       False  False
6  False  False   False       False  False
7  False  False   False       False  False

In [23]:
#Using isna()- same as the isnull() function, provides the same output
data.isna()

      id   name  salary  start_date   dept
0  False  False   False       False  False
1  False  False   False       False  False
2  False  False   False       False  False
3  False  False   False       False  False
4  False  False   False       False  False
5  False  False   False       False  False
6  False  False   False       False  False
7  False  False   False       False  False

In [24]:
#Using isna().any()- gives a boolean value if any null value is present or not, 
#but it gives results column-wise, not in tabular format.
data.isna().any()

id            False
name          False
salary        False
start_date    False
dept          False
dtype: bool

In [16]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df.isna().any()

one      True
two      True
three    True
dtype: bool

In [25]:
#Using isna().sum() - gives the sum of the null values preset in the dataset column-wise.
data.isna().sum()

id            0
name          0
salary        0
start_date    0
dept          0
dtype: int64

In [26]:
df.isna().sum()

one      3
two      3
three    3
dtype: int64

In [27]:
#Using isna().any().sum()- gives output in a single value if any null is present or not.
data.isna().any().sum()

0

In [28]:
df.isna().any().sum()

3

In [ ]:
#separate the numeric columns from the categorical columns

In [29]:
print(data)

   id    name  salary  start_date        dept
0   1    Rick  623.30  2012-01-01          IT
1   2     Dan  515.20  2013-09-23  Operations
2   3   Tusar  611.00  2014-11-15          IT
3   4    Ryan  729.00  2014-05-11          HR
4   5    Gary  843.25  2015-03-27     Finance
5   6   Rasmi  578.00  2013-05-21          IT
6   7  Pranab  632.80  2013-07-30  Operations
7   8    Guru  722.50  2014-06-17     Finance

In [28]:
# select numerical columns
data_numeric = data.select_dtypes(include=[np.number])
numeric_cols = data_numeric.columns.values
# select non-numeric columns
data_non_numeric = data.select_dtypes(exclude=[np.number])
non_numeric_cols = data_non_numeric.columns.values

In [31]:
#Dropping feature
#Dropping feature usually isn’t recommended because you’re losing information. 
#But column isn’t important or simply has too many missing values,drop them. 
#To drop features, use drop and set axis to 1 and inplace to true. 
#Axis is 1 because we want to drop columns (0 means row), inplace is because transforming it dataset.

# Drop unnecessary columns that are not important

data1 = pd.read_csv('input.csv')
col_Drop = ['id']
data1.drop(col_Drop, axis=1, inplace=True)

print(data1)

     name  salary  start_date        dept
0    Rick  623.30  2012-01-01          IT
1     Dan  515.20  2013-09-23  Operations
2   Tusar  611.00  2014-11-15          IT
3    Ryan  729.00  2014-05-11          HR
4    Gary  843.25  2015-03-27     Finance
5   Rasmi  578.00  2013-05-21          IT
6  Pranab  632.80  2013-07-30  Operations
7    Guru  722.50  2014-06-17     Finance

In [30]:
#Dropping the row
#to remove rows use dropna
data1 = pd.read_csv('input.csv')
data1['salary'].dropna(inplace=True)
print(data1)

   id    name  salary  start_date        dept
0   1    Rick  623.30  2012-01-01          IT
1   2     Dan  515.20  2013-09-23  Operations
2   3   Tusar  611.00  2014-11-15          IT
3   4    Ryan  729.00  2014-05-11          HR
4   5    Gary  843.25  2015-03-27     Finance
5   6   Rasmi  578.00  2013-05-21          IT
6   7  Pranab  632.80  2013-07-30  Operations
7   8    Guru  722.50  2014-06-17     Finance

In [ ]:
#Imputing-3 main techniques s
#fillna — filling in null values based on given value (mean, median, mode, or specified value)
#bfill / ffill — stands for backward fill and forward fill (filling in missing values based on the value after or before the column.)
#Simple Imputer — Sk-learn’s built-in function that imputes missing values (commonly used alongside a pipeline when building ML models)

In [34]:
#any null values preset, fill those places with any other value using the fillna() function of DataFrame.
#It will fill NA/NaN or 0 values in place of null spaces.
data.fillna(value=0, method=None, axis=None, inplace=False, limit=None, downcast=None)

   id    name  salary  start_date        dept
0   1    Rick  623.30  2012-01-01          IT
1   2     Dan  515.20  2013-09-23  Operations
2   3   Tusar  611.00  2014-11-15          IT
3   4    Ryan  729.00  2014-05-11          HR
4   5    Gary  843.25  2015-03-27     Finance
5   6   Rasmi  578.00  2013-05-21          IT
6   7  Pranab  632.80  2013-07-30  Operations
7   8    Guru  722.50  2014-06-17     Finance

In [36]:
# imputing slary with mean
salary_mean_value = round(data['salary'].mean(), 2)
data['salary'].fillna(salary_mean_value, inplace=True)

# imputing price with median
salary_median_value = round(data['salary'].median(), 2)
data['salary'].fillna(salary_median_value, inplace=True)

print(data)

   id    name  salary  start_date        dept
0   1    Rick  623.30  2012-01-01          IT
1   2     Dan  515.20  2013-09-23  Operations
2   3   Tusar  611.00  2014-11-15          IT
3   4    Ryan  729.00  2014-05-11          HR
4   5    Gary  843.25  2015-03-27     Finance
5   6   Rasmi  578.00  2013-05-21          IT
6   7  Pranab  632.80  2013-07-30  Operations
7   8    Guru  722.50  2014-06-17     Finance

In [32]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
print(df)
mean_value = round(df['one'].mean(), 2)
df['one'].fillna(mean_value, inplace=True)
print("Using mean")
print(df)

# imputing price with median
median_value = round(df['one'].median(), 2)
df['one'].fillna(median_value, inplace=True)
print("Using median")
print(df)

        one       two     three
a  0.473533  1.371196 -0.525459
b       NaN       NaN       NaN
c -0.062392 -1.509855 -1.522624
d       NaN       NaN       NaN
e  0.346443 -1.245657 -1.561010
f  1.362842  0.216112  0.912254
g       NaN       NaN       NaN
h -0.031909  0.629039  0.013886
Using mean
        one       two     three
a  0.473533  1.371196 -0.525459
b  0.420000       NaN       NaN
c -0.062392 -1.509855 -1.522624
d  0.420000       NaN       NaN
e  0.346443 -1.245657 -1.561010
f  1.362842  0.216112  0.912254
g  0.420000       NaN       NaN
h -0.031909  0.629039  0.013886
Using median
        one       two     three
a  0.473533  1.371196 -0.525459
b  0.420000       NaN       NaN
c -0.062392 -1.509855 -1.522624
d  0.420000       NaN       NaN
e  0.346443 -1.245657 -1.561010
f  1.362842  0.216112  0.912254
g  0.420000       NaN       NaN
h -0.031909  0.629039  0.013886

In [37]:
# imputing with bfill or ffill
data['salary'].bfill(inplace=True)
data['salary'].ffill(inplace=True)
print(data)

   id    name  salary  start_date        dept
0   1    Rick  623.30  2012-01-01          IT
1   2     Dan  515.20  2013-09-23  Operations
2   3   Tusar  611.00  2014-11-15          IT
3   4    Ryan  729.00  2014-05-11          HR
4   5    Gary  843.25  2015-03-27     Finance
5   6   Rasmi  578.00  2013-05-21          IT
6   7  Pranab  632.80  2013-07-30  Operations
7   8    Guru  722.50  2014-06-17     Finance

In [8]:
import pandas as pd
import numpy as np
# imputing with SimpleImputor from the sklearn library
from sklearn.impute import SimpleImputer

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
print(df)
# define the imputer
imr = SimpleImputer(missing_values=np.nan, strategy='mean') # or median
df[['one']] = imr.fit_transform(df[['one']])
print(df)

        one       two     three
a  2.294717 -0.080810  0.841469
b       NaN       NaN       NaN
c  0.095321  0.711097  0.303906
d       NaN       NaN       NaN
e  0.311389 -1.384007  0.604591
f -0.110898  0.471896 -0.918258
g       NaN       NaN       NaN
h -0.383113 -0.704146  0.538788
        one       two     three
a  2.294717 -0.080810  0.841469
b  0.441483       NaN       NaN
c  0.095321  0.711097  0.303906
d  0.441483       NaN       NaN
e  0.311389 -1.384007  0.604591
f -0.110898  0.471896 -0.918258
g  0.441483       NaN       NaN
h -0.383113 -0.704146  0.538788